Tsung tests/stats/m1.medium tests/6/example.xml
<?xml version="1.0"?><tsung loglevel="notice" version="1.0">

  <clients>
    <client host="tsung1" weight="1" maxusers="500">
       <ip value="10.248.97.171"/>
    </client>

    <client host="tsung2" weight="1" maxusers="500">
       <ip value="10.249.194.240"/>
    </client>

    <client host="tsung3" weight="1" maxusers="500">
       <ip value="10.249.114.225"/>
    </client>
  </clients>

  <servers>
  <server host="46.137.180.210" port="8080" type="tcp"/>
</servers>

  <monitoring>
    <monitor host="myserver" type="snmp"/>
  </monitoring>

  <load>
  <arrivalphase phase="1" duration="120" unit="second">
     <users arrivalrate="3" unit="second"/>
   </arrivalphase>
  </load>

  <options>
   <option type="ts_http" name="user_agent">
    <user_agent probability="80">Mozilla/5.0 (X11; U; Linux i686; en-US; rv:1.7.8) Gecko/20050513 Galeon/1.3.21</user_agent>
    <user_agent probability="20">Mozilla/5.0 (Windows; U; Windows NT 5.2; fr-FR; rv:1.7.8) Gecko/20050511 Firefox/1.0.4</user_agent>
 </option>
  </options>

  <sessions>
   <session name="zompopo" probability="100" type="ts_http">
   <request>
     <http url="/webandroid/android" version="1.1" contents_from_file="/home/ubuntu/.tsung/tsung_recorder20130425-20:29-1.bin" content_type="multipart/form-data; boundary=---------------------------148675415415754762921955381461" method="POST">
     </http>
   </request>
   </session>

 </sessions>

</tsung>